In [5]:
import pandas as pd
a={"Name":["Alice","Bob","Me"],
   "Age":[24,25,20],
   "City":["Tokiyo","Los Angeles","New york"]
    }
d=pd.DataFrame(a)
print(d)

    Name  Age         City
0  alice   24       Tokiyo
1    bob   25  Los Angeles
2     me   20     New york

In [7]:
print(d.head(2))

    Name  Age         City
0  alice   24       Tokiyo
1    bob   25  Los Angeles

In [9]:
print(d.tail(1))

  Name  Age      City
2   me   20  New york

In [11]:
print(d.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None

In [15]:
print(d.describe())

             Age
count   3.000000
mean   23.000000
std     2.645751
min    20.000000
25%    22.000000
50%    24.000000
75%    24.500000
max    25.000000

In [17]:
print(d["City"])

0         Tokiyo
1    Los Angeles
2       New york
Name: City, dtype: object

In [19]:
print(d[d['Age']>22])

    Name  Age         City
0  alice   24       Tokiyo
1    bob   25  Los Angeles

In [21]:
d['Salary']=[300000,400000,500000]
print(d)

    Name  Age         City  Salary
0  alice   24       Tokiyo  300000
1    bob   25  Los Angeles  400000
2     me   20     New york  500000

In [23]:
d['Salary']+=100000
print(d)

    Name  Age         City  Salary
0  alice   24       Tokiyo  400000
1    bob   25  Los Angeles  500000
2     me   20     New york  600000

In [ ]:
#d.drop(coloum="")
#d.drop(index=1)